// SPDX-License-Identifier: MIT
pragma solidity ^0.8.11;

contract MyToken {

    /*
        Q6: 나만의 Token 발행하기
        나만의 토큰을 발행하고 관리하는 컨트랙트를 만들어 봅시다.

        필수적으로 구현해야 할 것:
        토큰의 이름 및 심볼(약어), 총 발행량, Decimal(자리수)를 저장하는 변수를 생성하세요.
        토큰 보유자의 주소에 따른 잔고를 저장하는 매핑(balanceOf)을 생성하세요.
        최초 컨트랙트 배포 시 생성자를 이용하여 balanceOf[배포자의 주소] = 총 발행량이 되도록 하세요.
        전송 대상과 토큰 수량을 input으로 받아, 토큰을 전송 대상에게 전송하는 transfer 함수를 작성하세요.
        transfer 함수가 실행될 시, 보낸 사람의 주소와 전송 대상의 주소와 전송된 토큰 수량을 출력하는 이벤트를 작성하세요.
        
        필수적으로 구현해야 할 것 외에 여러분이 넣고 싶은 다양한 기능을 넣어도 좋습니다:)
        (단, Approve와 TransferFrom 기능은 Q8에서 구현합니다. )
    */

    // 여기에 코드를 작성하세요.

}